test.yml
config:
  target: 'http://test.api.foxsports.com/sportsdata/v1'
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 50
  environments:
    production: 
      target: 'http://api.foxsports.com/sportsdata/v1'
      phases: 
        - duration: 10
          arrivalRate: 10
          rampTo: 50
    staging: 
      target: 'http://fsapp-integration-public-537093566.us-east-1.elb.amazonaws.com/v1'
      phases: 
        - duration: 10
          arrivalRate: 10
          rampTo: 50
  variables: 
    apikey:
      - '?apikey=jE7yBJVRNAwdDesMgTzTXUUSx1It41Fq'
scenarios:
  - name: MLB Scoreboard Main
    weight: 40
    flow:
      - get:
          url: "/mlb/scoreboard/main"
  - name: MLB Scoreboard Today
    weight: 10
    flow:
      - get:
          url: "/mlb/scoreboard/segment/20190924"
  - name: NFL Scoreboard Main
    weight: 40
    flow:
      - get:
          url: "/nfl/scoreboard/main"
  - name: NFL Scoreboard Week
    weight: 10
    flow:
      - get:
          url: "/nfl/scoreboard/segment/week"