test.yml
config:
  target: 'http://fsapp-integration-public-537093566.us-east-1.elb.amazonaws.com/v1'
  processor: "my-functions.js"
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 50
  environments:
    integration: 
      target: 'http://fsapp-integration-public-537093566.us-east-1.elb.amazonaws.com/v1'
      phases: 
        - duration: 10
          arrivalRate: 10
          rampTo: 50
    staging: 
      target: 'http://fsapp-integration-public-537093566.us-east-1.elb.amazonaws.com/v1'
      phases: 
        - duration: 10
          arrivalRate: 10
          rampTo: 50
   
   
  config:
    payload:
      # path is relative to the location of the test script
      path: "payload.csv"
      fields:
        - "nflWeek"
        - "cfbWeek"
        - "conference"
  variables: 
    apikey:
      - '?apikey=jE7yBJVRNAwdDesMgTzTXUUSx1It41Fq'
scenarios:
  - name: MLB Scoreboard Main
    weight: 18
    flow:
      - get:
          url: "/mlb/scoreboard/main"
          afterResponse: "logBody"

  - name: MLB Scoreboard Today
    weight: 8
    flow:
      - get:
          url: "/mlb/scoreboard/segment/20190924"
          afterResponse: "logBody"
  - name: NFL Scoreboard Main
    weight: 18
    flow:
      - get:
          url: "/nfl/scoreboard/main"
          afterResponse: "logBody"
  - name: NFL Scoreboard Week
    weight: 8
    flow:
      - get:
          url: "/nfl/scoreboard/segment/{{ nflWeek }}"
          afterResponse: "logBody"
  - name: CFB Scoreboard Main
    weight: 18
    flow:
      - get:
          url: "/nfl/scoreboard/main"
          afterResponse: "logBody"
  - name: CFB Scoreboard Week
    weight: 8
    flow:
      - get:
          url: "/nfl/scoreboard/segment/{{ cfbWeek }}"
          afterResponse: "logBody"