test.yml
config:
  target: 'http://test.api.foxsports.com/sportsdata/v1'
  phases:
    - duration: 1
      arrivalRate: 100
  environments:
    production: 
      target: 'http://api.foxsports.com/sportsdata/v1'
      phases: 
        - duration: 1
          arrivalRate: 100
    staging: 
      target: 'http://fsapp-qa-public-loadbalancer-579034957.us-east-1.elb.amazonaws.com/v1'
      phases: 
        - duration: 10
          arrivalRate: 100
  variables: 
    apikey:
      - '?apikey=jE7yBJVRNAwdDesMgTzTXUUSx1It41Fq'
scenarios:
  - name: MLB Scoreboard Main
    flow:
      - get:
          url: "/mlb/scoreboard/main"